## pandas merge

In [9]:
import pandas as pd

left = pd.DataFrame({
    'id': [1, 2, 3, 5],
    'name': ['alice', 'bob', 'curt', 'marry'],
    'age': [20, 21, 22, 23]
})

right = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'like': ['basketball', 'football', 'dance', 'music'],
})

In [10]:
pd.merge(left, right, on='id', how='inner')

   id   name  age        like
0   1  alice   20  basketball
1   2    bob   21    football
2   3   curt   22       dance

In [11]:
pd.merge(left, right, on='id', how='left')

   id   name  age        like
0   1  alice   20  basketball
1   2    bob   21    football
2   3   curt   22       dance
3   5  marry   23         NaN

In [12]:
pd.merge(left, right, on='id', how='right')

   id   name   age        like
0   1  alice  20.0  basketball
1   2    bob  21.0    football
2   3   curt  22.0       dance
3   4    NaN   NaN       music

In [13]:
pd.merge(left, right, on='id', how='outer')

   id   name   age        like
0   1  alice  20.0  basketball
1   2    bob  21.0    football
2   3   curt  22.0       dance
3   5  marry  23.0         NaN
4   4    NaN   NaN       music